In [2]:
import pandas as pd
import numpy as np

In [3]:
labels = ['a','b','c']
minha_lista = [10,20,30]
arr = np.array(['10,20,30'])
d = {'a':10, 'b':20, 'c':30}

In [6]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [7]:
pd.Series(data=labels, index=minha_lista)

10    a
20    b
30    c
dtype: object

In [8]:
pd.Series(labels, minha_lista)

10    a
20    b
30    c
dtype: object

In [9]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
series1 = pd.Series([1,2,3,4], index=['EUA', 'Alemanha', 'Russia', 'Japão'])
series1

EUA         1
Alemanha    2
Russia      3
Japão       4
dtype: int64

In [11]:
series1['EUA']

1

In [12]:
series1[['EUA', 'Russia']]

EUA       1
Russia    3
dtype: int64

DataFrames

In [4]:
from numpy.random import randn
df = pd.DataFrame(randn(5, 4), index=['A','B','C','D','E'], columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.752752  1.305297  0.161612 -0.298430
B -1.111004 -1.240839 -0.335756  1.260837
C -0.798023 -1.449567  3.055345 -0.750863
D -0.505344  1.636959  0.842224 -1.979020
E -0.303526 -2.487345 -0.086352 -0.548390

In [5]:
df[['W']]

          W
A  0.752752
B -1.111004
C -0.798023
D -0.505344
E -0.303526

In [28]:
# Criar uma nova coluna com outro nome, cópia da coluna W por exemplo
df['new'] = df['W'] # o df new vai ser uma nova coluna igual ao df W
df

          W         X         Y         Z      SOMA       new
A -1.119226  0.446733  0.768920 -1.482843 -0.350306 -1.119226
B  0.251406 -0.363056 -1.030689  0.951450 -0.779284  0.251406
C  1.303930 -2.380382  1.965570 -0.349762  3.269500  1.303930
D -0.614009  0.597559  0.361250 -0.377287 -0.252759 -0.614009
E -0.483289 -0.143116 -0.355832 -1.016807 -0.839122 -0.483289

In [29]:
# Criar uma nova coluna com a soma de colunas
df['SOMA'] = df['W'] + df['Y']
df

          W         X         Y         Z      SOMA       new
A -1.119226  0.446733  0.768920 -1.482843 -0.350306 -1.119226
B  0.251406 -0.363056 -1.030689  0.951450 -0.779284  0.251406
C  1.303930 -2.380382  1.965570 -0.349762  3.269500  1.303930
D -0.614009  0.597559  0.361250 -0.377287 -0.252759 -0.614009
E -0.483289 -0.143116 -0.355832 -1.016807 -0.839122 -0.483289

In [30]:
# Deletar uma coluna porem NÃO ALTERA O ORIGINAL
# Axis = eixo
# Eixo 1 = colunas, Eixo 0 = linhas
df.drop('new', axis=1)

          W         X         Y         Z      SOMA
A -1.119226  0.446733  0.768920 -1.482843 -0.350306
B  0.251406 -0.363056 -1.030689  0.951450 -0.779284
C  1.303930 -2.380382  1.965570 -0.349762  3.269500
D -0.614009  0.597559  0.361250 -0.377287 -0.252759
E -0.483289 -0.143116 -0.355832 -1.016807 -0.839122

In [34]:
# para alterar o original usar inplace True
# df.drop('new', axis=1, inplace=True)
df

          W         X         Y         Z      SOMA
A -1.119226  0.446733  0.768920 -1.482843 -0.350306
B  0.251406 -0.363056 -1.030689  0.951450 -0.779284
C  1.303930 -2.380382  1.965570 -0.349762  3.269500
D -0.614009  0.597559  0.361250 -0.377287 -0.252759
E -0.483289 -0.143116 -0.355832 -1.016807 -0.839122

Iloc e filtros

In [6]:
df.loc[['A','B']] # trazer só as linas do index

          W         X         Y         Z
A  0.752752  1.305297  0.161612 -0.298430
B -1.111004 -1.240839 -0.335756  1.260837

In [8]:
df.loc[['A', 'B'], ['X']]

          X
A  1.305297
B -1.240839

In [37]:
# Trazer um item específico
df.iloc[0,2] # traz o index(linha) 0 e series(coluna) 2

0.7689201180151364

In [9]:
df.iloc[:-1, :] # Mesma forma de trazer a tabela, tudo da linha até a penultima linha

          W         X         Y         Z
A  0.752752  1.305297  0.161612 -0.298430
B -1.111004 -1.240839 -0.335756  1.260837
C -0.798023 -1.449567  3.055345 -0.750863
D -0.505344  1.636959  0.842224 -1.979020

In [11]:
df.iloc[1:4, 1:3]

          X         Y
B -1.240839 -0.335756
C -1.449567  3.055345
D  1.636959  0.842224

In [13]:
df[df > 0] # Trazer a tabela com os números positivos amostra

          W         X         Y         Z
A  0.752752  1.305297  0.161612       NaN
B       NaN       NaN       NaN  1.260837
C       NaN       NaN  3.055345       NaN
D       NaN  1.636959  0.842224       NaN
E       NaN       NaN       NaN       NaN

In [14]:
df['Y'] > 0 # mostrar da lista Y os maiores que zero como verdadeiro

A     True
B    False
C     True
D     True
E    False
Name: Y, dtype: bool

In [15]:
df[df['Y'] > 0]

          W         X         Y         Z
A  0.752752  1.305297  0.161612 -0.298430
C -0.798023 -1.449567  3.055345 -0.750863
D -0.505344  1.636959  0.842224 -1.979020

In [17]:
df[(df['Y'] > 0) & (df['X'] > 0)] # onde na linha(index) de Y e X é maior do que 0

          W         X         Y        Z
A  0.752752  1.305297  0.161612 -0.29843
D -0.505344  1.636959  0.842224 -1.97902

Mais detalhes do índice

In [35]:
df.index # ou df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object', name='index')

In [41]:
df.reset_index(inplace=True) #RESET INDEX, REVERTER O INDEX

ValueError: cannot insert level_0, already exists

In [42]:
df

  index  level_0         W         X         Y         Z
0     A        0  0.752752  1.305297  0.161612 -0.298430
1     B        1 -1.111004 -1.240839 -0.335756  1.260837
2     C        2 -0.798023 -1.449567  3.055345 -0.750863
3     D        3 -0.505344  1.636959  0.842224 -1.979020
4     E        4 -0.303526 -2.487345 -0.086352 -0.548390

In [43]:
df.set_index('index', inplace=True) # Atualize a coluna index(indices) com o nome 'index'

In [46]:
df # Resultado:

              W         X         Y         Z
index
A      0.752752  1.305297  0.161612 -0.298430
B     -1.111004 -1.240839 -0.335756  1.260837
C     -0.798023 -1.449567  3.055345 -0.750863
D     -0.505344  1.636959  0.842224 -1.979020
E     -0.303526 -2.487345 -0.086352 -0.548390

In [47]:
novoind = 'CA NY WY OR CO'.split() # A lista tem que ter o mesmo tamanho da coluna index

In [48]:
df['novo_index'] = novoind

In [51]:
df.reset_index().set_index('novo_index')

           index         W         X         Y         Z
novo_index
CA             A  0.752752  1.305297  0.161612 -0.298430
NY             B -1.111004 -1.240839 -0.335756  1.260837
WY             C -0.798023 -1.449567  3.055345 -0.750863
OR             D -0.505344  1.636959  0.842224 -1.979020
CO             E -0.303526 -2.487345 -0.086352 -0.548390

Hierarquia de índices e índices múltiplos

In [52]:
# Niveis de Índice
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3, 1,2,3]

hier_index = list(zip(outside, inside))

In [53]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [54]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [55]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [56]:
dataf = pd.DataFrame(np.random.randn(6, 2), index=hier_index, columns=['A', 'B'])
dataf

             A         B
G1 1  0.063470 -0.819764
   2  0.035874  0.269233
   3  0.665300 -1.508845
G2 1 -0.456473  0.143505
   2  1.207892 -0.207657
   3  0.453825  1.237821

In [57]:
dataf.loc['G1']

          A         B
1  0.063470 -0.819764
2  0.035874  0.269233
3  0.665300 -1.508845

In [60]:
dataf.loc['G1'].loc[1]

A    0.063470
B   -0.819764
Name: 1, dtype: float64

In [61]:
dataf.index.names = ['Grupo', 'Número']

In [62]:
dataf

                     A         B
Grupo Número
G1    1       0.063470 -0.819764
      2       0.035874  0.269233
      3       0.665300 -1.508845
G2    1      -0.456473  0.143505
      2       1.207892 -0.207657
      3       0.453825  1.237821

In [64]:
dataf.xs(1, level='Número') # Trazer só as informações da primeira linhas de cada Grupo

              A         B
Grupo
G1     0.063470 -0.819764
G2    -0.456473  0.143505